Revit 2024 API
RebarShape.GetHookRotationAngle Method
 Gets the out of plane hook rotation angle at the specified end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public double GetHookRotationAngle(
	int iEnd
)
Visual Basic
Public Function GetHookRotationAngle ( _
	iEnd As Integer _
) As Double
Visual C++
public:
double GetHookRotationAngle(
	int iEnd
)
Parameters
iEnd
Type: System.Int32
 0 for the start , 1 for the end.
Return Value
 Returns the out of plane hook rotation angle at the specified end.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  iEnd must be 0 or 1.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace